{"architectures": ["T5ForConditionalGeneration"], "d_model": 512, "d_ff": 2048, "dropout_rate": 0.1, "eos_token_id": 1, "initializer_factor": 1.0, "layer_norm_epsilon": 1e-06, "model_type": "t5", "num_heads": 8, "num_layers": 6, "output_past": true, "pad_token_id": 0, "relative_attention_num_buckets": 32, "task_specific_params": {"translation_en_to_fr": {"prefix": "translate English to French: "}, "translation_en_to_de": {"prefix": "translate English to German: "}}, "vocab_size": 32128}